# All software available via homebrew: https://formulae.brew.sh

# communication
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997

# design, media
cask "omnigraffle"
cask "obs" # screen recording with mic and system audio

# writing, office
cask "typora"
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
cask "brave-browser"
mas "Microsoft Outlook", id: 985367838
cask "microsoft-teams"

# basic developer tools
brew "git"
cask "focus"
cask "font-fira-code" # monospaced font with coding ligatures
cask "fork"
cask "raycast"

# IDEs and coding agents
cask "warp" # serves as terminal, coding agent and IDE
cask "cursor"
cask "claude-code" # (is a cask because it is a binary)
vscode "anthropic.claude-code"

# Apple development
brew "xcodes"
cask "xcodes-app"
mas "Developer", id: 640199958

# Apple Fonts: https://developer.apple.com/fonts
cask "font-sf-pro" 
cask "font-sf-compact"  
cask "font-sf-mono"
cask "font-new-york"

# Python development
brew "xz" # Required for installing certain Python versions via pyenv
brew "pyenv" # python version manager
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"

# Flutter development
tap "leoafarias/fvm" # Required for installing fvm
brew "fvm" # flutter version manager

# Required dependencies for Brewfile (do not remove)
brew "mas" # ⚠️ Required for declaring mac app store apps
cask "visual-studio-code" # ⚠️ Required for declaring vs code extensions